githot/app/views/profiles/index.html.erb

                    <ul class="list-group list-group-flush">
                        <% if !current_user.comments.empty?%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]