githot/app/controllers/comments_controller.rb

SELECT  "repos".* FROM "repos" WHERE "repos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "repo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "yeah yeah yeah"], ["user_id", 1], ["repo_id", 1], ["created_at", "2020-05-07 23:26:47.200786"], ["updated_at", "2020-05-07 23:26:47.200786"]]
---
    def create
        @repo = Repo.find(params[:repo_id])
        @comment = current_user.comments.create(repo_id: @repo[:id], body: comment_params[:body])