githot/app/controllers/profiles_controller.rb

    def index
        @user = User.find(params[:id])
        @comments = Comment.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"

    def update
        @user = User.update(params[:id], user_params)
---
UPDATE "users" SET "bio" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["bio", "yeah yeah yeah"], ["updated_at", "2020-05-08 00:11:14.501500"], ["id", 1]]