githot/app/controllers/repos_controller.rb

SELECT "repos".* FROM "repos"
---
    def index
        @repos = Repo.all

SELECT  "repos".* FROM "repos" WHERE "repos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."repo_id" = $1  [["repo_id", 1]]
---
    def show
        @repo = Repo.find(params[:id])
        @comments = Comment.all