githot/app/views/shared/_comments.html.erb

        <ul class="list-group list-group-flush">
            <% if !@repo.comments.empty?%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."repo_id" = $1  [["repo_id", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."repo_id" = $1 LIMIT $2  [["repo_id", 1], ["LIMIT", 1]]